In [1]:
import sqlite3
import pandas as pd
import os
print(os.path.abspath('../'))
file_path = os.path.abspath('../New folder')
print(file_path)

C:\Users\FARHAN SHAIKH\Desktop
C:\Users\FARHAN SHAIKH\Desktop\New folder

In [2]:
con = sqlite3.connect('C:/Users/FARHAN SHAIKH/Desktop/New folder/movie_analytics_lab15.db')

In [3]:
query = "SELECT * FROM movie"
print(pd.read_sql_query(query, con))

            id                                              title  year nth  \
0            1                              !Women Art Revolution  2010
1            2                                                 #1  2005
2            3                                                 #1  2010
3            4                                                 #1  2010   I
4            5                                #1 Cheerleader Camp  2010
...        ...                                                ...   ...  ..
530251  530252                                         Þyngdarafl  2010
530252  530253                                            à parte  2010
530253  530254                                           ìCàcaro!  2002
530254  530255                  ìMaten a ese hijo de la chingada!  2008
530255  530256  íslenska, on the Road to Unearth Iceland's Sec...  2007

        for_video
0               0
1               0
2               0
3               1
4               1
...           ...
530251          0
530252          0
530253          0
530254          1
530255          0

[530256 rows x 5 columns]

In [4]:
query = "SELECT * FROM actor"
print(pd.read_sql_query(query, con))

              id                         name gender
0              1                      $, Homo      m
1              2                     $, Steve      m
2              3                   $hort, Too      m
3              4                $lim, Bee Moe      m
4              5       'Avacado' Wolfe, David      m
...          ...                          ...    ...
1724711  1724712  Þórðarson, Theodór Kristinn      m
1724712  1724713           Þórðarsson, Haukur      m
1724713  1724714       Þórólfsdóttir, Kristín      f
1724714  1724715            à Hiller, Legaren      m
1724715  1724716                á Rógvu, Rosa      f

[1724716 rows x 3 columns]

In [6]:
query = "SELECT * FROM role"
print(pd.read_sql_query(query, con))

         movie_id  actor_id                      name
0          313958         1                   Himself
1          128021         2                      None
2           27289         3                 Too $hort
3           48898         3                   Himself
4          162990         3                   Himself
...           ...       ...                       ...
5321138    333408   1724706  Woman with baby carriage
5321139      5138   1724707                      None
5321140    529793   1724708         Kona laxveiðimans
5321141    130681   1724714         Foreldrar á fundi
5321142     71410   1724716         Pensionatværtinde

[5321143 rows x 3 columns]

In [7]:
query = "SELECT * FROM movie WHERE title = 'Holiday Road'"
print(pd.read_sql_query(query, con))

       id         title  year nth  for_video
0  188845  Holiday Road  2012              0

In [8]:
query = "SELECT * FROM movie WHERE title = 'Cinema Six' AND 'Excuse Me'"
print(pd.read_sql_query(query, con))

Empty DataFrame
Columns: [id, title, year, nth, for_video]
Index: []

In [10]:
query = "SELECT * FROM movie WHERE title = 'Cinema Six' OR 'Excuse Me' AND year BETWEEN 2011 AND 2012"
print(pd.read_sql_query(query, con))

      id       title  year nth  for_video
0  84911  Cinema Six  2012              0

In [9]:
query = "SELECT * FROM role WHERE name = 'Charlie'"
print(pd.read_sql_query(query, con))

      movie_id  actor_id     name
0       177010       838  Charlie
1       310557      1796  Charlie
2       328882      3046  Charlie
3       181175      3576  Charlie
4        50519      3960  Charlie
...        ...       ...      ...
2275    271354   1643199  Charlie
2276    205919   1657144  Charlie
2277    398978   1657693  Charlie
2278    516851   1673699  Charlie
2279     17878   1690091  Charlie

[2280 rows x 3 columns]

In [11]:
query = "SELECT COUNT(*) FROM role WHERE name = 'Charlie'"
print(pd.read_sql_query(query, con))

   COUNT(*)
0      2280

In [12]:
query = "SELECT * FROM role WHERE name LIKE 'Ch%'"
print(pd.read_sql_query(query, con))

       movie_id  actor_id                  name
0        104140        21  Chavo Banda Galerias
1        271743       113          Chanteur rap
2        271743       116          Chanteur rap
3        300750       424                  Chad
4        440201       674       Charles Proctor
...         ...       ...                   ...
60235    233176   1723791           Chambermaid
60236    176967   1724384             Charlotte
60237    415744   1724384             Charlotte
60238    149238   1724388        Christina Berg
60239    504763   1724650                 Choir

[60240 rows x 3 columns]

In [13]:
query = "SELECT COUNT(*) FROM role WHERE name LIKE 'Ch%'"
print(pd.read_sql_query(query, con))

   COUNT(*)
0     60240

In [14]:
query = "SELECT * FROM movie WHERE year BETWEEN 2011 AND 2012"
print(pd.read_sql_query(query, con))

           id                                        title  year nth  \
0           7                             #1 With A Bullet  2011
1           9                                         #137  2011
2          10  #140Characters: A Documentary About Twitter  2011
3          15                                         #729  2011
4          19                                  #Indignados  2011
...       ...                                          ...   ...  ..
38043  530163                             Über uns das All  2011
38044  530184                                   Üksik saar  2012
38045  530193                           ÜnOfficially Yours  2012
38046  530248                         Þegar Kanínur Fljúga  2011
38047  530249                                Þetta Reddast  2012

       for_video
0              0
1              0
2              0
3              0
4              0
...          ...
38043          0
38044          0
38045          0
38046          0
38047          0

[38048 rows x 5 columns]

In [15]:
query = "SELECT * FROM movie WHERE year > 2012"
print(pd.read_sql_query(query, con))

          id                           title  year nth  for_video
0       1734                        13 Eerie  2013              0
1       1907                15 Past Midnight  2013              0
2       2331                            1961  2013              0
3       2587                          2 Guns  2013              0
4       2835                     20% Fiction  2013              0
...      ...                             ...   ...  ..        ...
1539  526870             Zmajovini pangalozi  2013              0
1540  527251             Zombie Massacre III  2013              0
1541  527328                    Zombieland 2  2013              0
1542  527491                     Zoolander 2  2014              0
1543  528419  xXx: The Return of Xander Cage  ????              0

[1544 rows x 5 columns]

In [16]:
query = "SELECT * FROM movie WHERE year > 2016 ORDER BY year DESC"
print(pd.read_sql_query(query, con))

         id                                              title  year nth  \
0      8385                                       A Ghost Tail  ????
1      8416                                 A Girl Named Angel  ????
2      8900                            A Highschool of Ski-ing  ????
3     12726             A Special Message from Eva Marie Saint  ????
4     13186                                   A Taste of Shane  ????
..      ...                                                ...   ...  ..
397  521533                                   Yellow Submarine  ????
398  524905                                           Za touge  ????
399  524906                                    Za touge part 2  ????
400  528419                     xXx: The Return of Xander Cage  ????
401  523686  Young Pretender: The Story of Bonnie Prince Ch...  2017

     for_video
0            0
1            0
2            0
3            0
4            1
..         ...
397          0
398          1
399          1
400          0
401          0

[402 rows x 5 columns]

In [17]:
query = "SELECT DISTINCT year FROM movie ORDER BY year ASC"
print(pd.read_sql_query(query, con))

     year
0    1888
1    1890
2    1891
3    1892
4    1893
..    ...
125  2014
126  2015
127  2016
128  2017
129  ????

[130 rows x 1 columns]

In [18]:
query = "SELECT * FROM role WHERE name LIKE '%der'"
print(pd.read_sql_query(query, con))

       movie_id  actor_id                   name
0         63550       160       Entourage Leader
1        124453       168              Bystander
2        361547       179                 Spider
3        320381       256              Bartender
4        499723       279                Pleader
...         ...       ...                    ...
24258    346923   1708792  Herself - Cheerleader
24259     18121   1709662                 Moeder
24260     24799   1709662     Nederlandse Moeder
24261    188514   1709662         Jenny's moeder
24262    262020   1724654             The Spider

[24263 rows x 3 columns]

In [19]:
query = "SELECT MIN(year) FROM movie "
print(pd.read_sql_query(query, con))

   MIN(year)
0       1888

In [20]:
query = "SELECT MAX(year) FROM movie "
print(pd.read_sql_query(query, con))

  MAX(year)
0      ????

In [21]:
query = "SELECT MAX(year) FROM movie WHERE year < '????' "
print(pd.read_sql_query(query, con))

   MAX(year)
0       2017

In [22]:
query = "SELECT MAX(year) FROM movie WHERE year < '????' AND 2017"
print(pd.read_sql_query(query, con))

   MAX(year)
0       2017

In [23]:
query = "SELECT COUNT(*) FROM movie WHERE year = '????' AND 2016 "
print(pd.read_sql_query(query, con))

   COUNT(*)
0       401

In [25]:
query = "SELECT * FROM actor inner JOIN role ON actor.id = role.actor_id WHERE actor.name LIKE 'El viti'"
print(pd.read_sql_query(query, con))

       id     name gender  movie_id  actor_id     name
0  435177  El Viti      m    270735    435177  Himself
1  435177  El Viti      m    394846    435177  Himself
2  435177  El Viti      m    482608    435177  Himself

In [26]:
query = "SELECT * FROM movie inner JOIN role ON movie.id = role.movie_id WHERE movie.title LIKE 'P-Word%Pizza'"
print(pd.read_sql_query(query, con))

       id         title  year nth  for_video  movie_id  actor_id       name
0  326552  P-Word Pizza  2011              0    326552     77167  Pizza Guy
1  326552  P-Word Pizza  2011              0    326552    276967       None
2  326552  P-Word Pizza  2011              0    326552    762707       None
3  326552  P-Word Pizza  2011              0    326552   1141913       None
4  326552  P-Word Pizza  2011              0    326552   1206154       None
5  326552  P-Word Pizza  2011              0    326552   1412871       None
6  326552  P-Word Pizza  2011              0    326552   1513705       None

In [27]:
query = "SELECT * FROM movie inner JOIN role ON movie.id = role.movie_id WHERE movie.title LIKE 'P-Word%Pizza' AND role.name LIKE 'Pizza%Guy'"
print(pd.read_sql_query(query, con))

       id         title  year nth  for_video  movie_id  actor_id       name
0  326552  P-Word Pizza  2011              0    326552     77167  Pizza Guy

In [28]:
query = "SELECT * FROM actor inner JOIN role ON actor.id = role.actor_id WHERE actor.name LIKE 'El viti'"
print(pd.read_sql_query(query, con))

       id     name gender  movie_id  actor_id     name
0  435177  El Viti      m    270735    435177  Himself
1  435177  El Viti      m    394846    435177  Himself
2  435177  El Viti      m    482608    435177  Himself